In [1]:
import pandas as pd

In [2]:
melb_data = pd.read_csv('data/melb_data.csv')
melb_data.head()

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1.0,94.0,126.0,1970.0,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0,"-37.8072, 144.9941"

In [3]:
melb_data.loc[15, 'Price']

1310000.0

In [4]:
melb_data.loc[90, 'Date']

'10/09/2016'

In [5]:
round(melb_data.loc[3521, 'Landsize'] / melb_data.loc[1690, 'Landsize'])

3

In [6]:
melb_data.shape

(13580, 23)

In [7]:
melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  float64
 12  Bathroom       13580 non-null  float64
 13  Car            13580 non-null  float64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  float64
 22  Coordinates    13580 non-null  object
dtypes: float64(11), int64(3), object(9)
memory usage: 2.4+ MB

In [8]:
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data['Bedroom'] = melb_data['Bedroom'].astype('int64')
melb_data['Bathroom'] = melb_data['Bathroom'].astype('int64')
melb_data['Propertycount'] = melb_data['Propertycount'].astype('int64')
melb_data['YearBuilt'] = melb_data['YearBuilt'].astype('int64')

melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Coordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

In [9]:
melb_data.describe().loc[:, ['Distance', 'BuildingArea' , 'Price']]

           Distance  BuildingArea         Price
count  13580.000000  13580.000000  1.358000e+04
mean      10.137776    139.633972  1.075684e+06
std        5.868725    392.217403  6.393107e+05
min        0.000000      0.000000  8.500000e+04
25%        6.100000    122.000000  6.500000e+05
50%        9.200000    126.000000  9.030000e+05
75%       13.000000    129.940000  1.330000e+06
max       48.100000  44515.000000  9.000000e+06

In [10]:
melb_data.describe(include=['object'])

,Suburb,Address,Type,Method,SellerG,Date,CouncilArea,Regionname,Coordinates
count,13580,13580,13580,13580,13580,13580,12211,13580,13580
unique,314,13378,3,5,268,58,33,8,13097
top,Reservoir,36 Aberfeldie St,h,S,Nelson,27/05/2017,Moreland,Southern Metropolitan,"-37.8361, 144.9966"
freq,359,3,9449,9022,1565,473,1163,4695,12

In [11]:
melb_data['Regionname'].value_counts()

Southern Metropolitan         4695
Northern Metropolitan         3890
Western Metropolitan          2948
Eastern Metropolitan          1471
South-Eastern Metropolitan     450
Eastern Victoria                53
Northern Victoria               41
Western Victoria                32
Name: Regionname, dtype: int64

In [12]:
round(melb_data['Regionname'].value_counts(normalize=True) * 100, 2)

Southern Metropolitan         34.57
Northern Metropolitan         28.65
Western Metropolitan          21.71
Eastern Metropolitan          10.83
South-Eastern Metropolitan     3.31
Eastern Victoria               0.39
Northern Victoria              0.30
Western Victoria               0.24
Name: Regionname, dtype: float64

In [13]:
round(melb_data['Type'].value_counts(normalize=True) * 100)

h    70.0
u    22.0
t     8.0
Name: Type, dtype: float64

In [14]:
melb_data['Propertycount'].max()

21650

In [15]:
round(melb_data['Distance'].std())

6

In [16]:
med = melb_data['BuildingArea'].median()
meaan = melb_data['BuildingArea'].mean()
delta1 = round((abs(med - meaan) / meaan) * 100)
delta1

10

In [17]:
melb_data['Bedroom'].mode()

0    3
Name: Bedroom, dtype: int64

In [18]:
melb_data[melb_data['Bathroom'] == 0].shape[0]

34

In [19]:
melb_data[(melb_data['SellerG'] == 'Nelson') & (melb_data['Price'] > 3000000)].shape[0]

5

In [20]:
melb_data[melb_data['BuildingArea'] == 0]['Price'].min()

412500.0

In [21]:
round(melb_data[(melb_data['Price'] < 1000000) & ((melb_data['Rooms'] > 5) | (melb_data['YearBuilt'] > 2015))]['Price'].mean())

769239

In [22]:
melb_data[(melb_data['Type'] == 'h') & (melb_data['Price'] < 3000000)]['Regionname'].mode()

0    Northern Metropolitan
Name: Regionname, dtype: object

In [23]:
student_data = pd.read_csv('data/students_performance.csv')
student_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [24]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [25]:
student_data.loc[155, 'writing score']

88

In [26]:
round(student_data['math score'].mean())

66

In [27]:
round(student_data['math score'].describe())

count    1000.0
mean       66.0
std        15.0
min         0.0
25%        57.0
50%        66.0
75%        77.0
max       100.0
Name: math score, dtype: float64

In [28]:
student_data['race/ethnicity'].mode()

0    group C
Name: race/ethnicity, dtype: object

In [29]:
round(student_data[student_data['test preparation course'] == 'completed']['reading score'].mean())

74

In [30]:
student_data[student_data['math score'] == 0].shape[0]

1

In [31]:
std_lunch = round(student_data[student_data['lunch'] == 'standard']['math score'].mean())
free_lunch = round(student_data[student_data['lunch'] == 'free/reduced']['math score'].mean())

print(std_lunch, free_lunch)

70 59

In [32]:
round(student_data['parental level of education'].value_counts(normalize=True) * 100)

some college          23.0
associate's degree    22.0
high school           20.0
some high school      18.0
bachelor's degree     12.0
master's degree        6.0
Name: parental level of education, dtype: float64

In [33]:
score_A = student_data[student_data['race/ethnicity'] == 'group A']['writing score'].median()
score_C = student_data[student_data['race/ethnicity'] == 'group C']['writing score'].mean()

delta2 = round(abs(score_A - score_C))
delta2

6

In [34]:
melb_df = melb_data.copy()
melb_df.head()

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1,202.0,126.0,1970,Yarra,-37.7996,144.9984,Northern Metropolitan,4019,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0,156.0,79.0,1900,Yarra,-37.8079,144.9934,Northern Metropolitan,4019,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0,134.0,150.0,1900,Yarra,-37.8093,144.9944,Northern Metropolitan,4019,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1,94.0,126.0,1970,Yarra,-37.7969,144.9969,Northern Metropolitan,4019,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2,120.0,142.0,2014,Yarra,-37.8072,144.9941,Northern Metropolitan,4019,"-37.8072, 144.9941"

In [35]:
melb_df = melb_df.drop(['index', 'Coordinates'], axis=1)
melb_df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067,...,1,1,202.0,126.0,1970,Yarra,-37.7996,144.9984,Northern Metropolitan,4019
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067,...,1,0,156.0,79.0,1900,Yarra,-37.8079,144.9934,Northern Metropolitan,4019
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067,...,2,0,134.0,150.0,1900,Yarra,-37.8093,144.9944,Northern Metropolitan,4019
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067,...,2,1,94.0,126.0,1970,Yarra,-37.7969,144.9969,Northern Metropolitan,4019
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067,...,1,2,120.0,142.0,2014,Yarra,-37.8072,144.9941,Northern Metropolitan,4019

In [36]:
total_rooms = melb_df['Rooms'] + melb_df['Bedroom'] + melb_df['Bathroom']
total_rooms

0         5
1         5
2         8
3         8
4         8
         ..
13575    10
13576     8
13577     8
13578     9
13579     9
Length: 13580, dtype: int64

In [37]:
melb_df['MeanRoomsSquare'] = melb_df['BuildingArea'] / total_rooms
melb_df['MeanRoomsSquare']

0        25.200000
1        15.800000
2        18.750000
3        15.750000
4        17.750000
           ...
13575    12.600000
13576    16.625000
13577    15.750000
13578    17.444444
13579    12.444444
Name: MeanRoomsSquare, Length: 13580, dtype: float64

In [38]:
diff_area = melb_df['BuildingArea'] - melb_df['Landsize']
sum_area = melb_df['BuildingArea'] + melb_df['Landsize']

melb_df['AreaRatio'] = diff_area / sum_area
melb_df['AreaRatio']

0       -0.231707
1       -0.327660
2        0.056338
3        0.145455
4        0.083969
           ...
13575   -0.676093
13576   -0.429185
13577   -0.551601
13578   -0.693060
13579   -0.527426
Name: AreaRatio, Length: 13580, dtype: float64

In [39]:
melb_df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount', 'MeanRoomsSquare',
       'AreaRatio'],
      dtype='object')

In [40]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [41]:
density = countries_df['population'] / countries_df['square'] * 1000000
density

0    421.976671
1      3.810842
2     32.796595
3      8.539467
4     75.377550
5     45.761079
6      6.253436
dtype: float64

In [42]:
mean_density = round(density.mean(), 2)
mean_density

84.93

In [43]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)
melb_df['Date']

0       2016-12-03
1       2016-02-04
2       2017-03-04
3       2017-03-04
4       2016-06-04
           ...
13575   2017-08-26
13576   2017-08-26
13577   2017-08-26
13578   2017-08-26
13579   2017-08-26
Name: Date, Length: 13580, dtype: datetime64[ns]

In [44]:
melb_df['MonthSale'] = melb_df['Date'].dt.month
round(melb_df['MonthSale'].value_counts(normalize=True) * 100, 2)

5     14.94
7     14.59
9     13.59
6     13.48
8     11.41
11     8.20
4      6.99
3      4.99
12     4.47
10     4.06
2      3.26
1      0.01
Name: MonthSale, dtype: float64

In [45]:
delta_days = melb_df['Date'] - pd.to_datetime('2016-01-01')
delta_days

0       337 days
1        34 days
2       428 days
3       428 days
4       155 days
          ...
13575   603 days
13576   603 days
13577   603 days
13578   603 days
13579   603 days
Name: Date, Length: 13580, dtype: timedelta64[ns]

In [46]:
delta_days.dt.days

0        337
1         34
2        428
3        428
4        155
        ...
13575    603
13576    603
13577    603
13578    603
13579    603
Name: Date, Length: 13580, dtype: int64

In [47]:
melb_df['AgeBuilding'] = melb_df['Date'].dt.year - melb_df['YearBuilt']
melb_df['AgeBuilding']

0         46
1        116
2        117
3         47
4          2
        ...
13575     36
13576     22
13577     20
13578     97
13579     97
Name: AgeBuilding, Length: 13580, dtype: int64

In [48]:
melb_df = melb_df.drop('YearBuilt', axis=1)

In [49]:
melb_df['WeekdaySale'] = melb_df['Date'].dt.dayofweek
melb_df[(melb_df['WeekdaySale'] == 5) | (melb_df['WeekdaySale'] == 6)].shape[0]

12822

In [50]:
ufo_df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')
ufo_df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [51]:
ufo_df['Time'] = pd.to_datetime(ufo_df['Time'])

In [52]:
ufo_year = ufo_df['Time'].dt.year
ufo_year.mode()[0]

1999

In [53]:
ufo_df['Date'] = ufo_df['Time'].dt.date
ufo_df[ufo_df['State'] == 'NV']['Date'].diff()

76            NaT
172     1678 days
565     2767 days
566        0 days
613      290 days
           ...
17447     22 days
17567     14 days
17617      6 days
17890     32 days
18104     33 days
Name: Date, Length: 284, dtype: timedelta64[ns]

In [54]:
ufo_df[ufo_df['State'] == 'NV']['Date'].diff().dt.days

76          NaN
172      1678.0
565      2767.0
566         0.0
613       290.0
          ...
17447      22.0
17567      14.0
17617       6.0
17890      32.0
18104      33.0
Name: Date, Length: 284, dtype: float64

In [55]:
round(ufo_df[ufo_df['State'] == 'NV']['Date'].diff().dt.days.mean())

69

In [56]:
def get_street_type(address):
# Создаём список географических пометок exclude_list.
    exclude_list = ['N', 'S', 'W', 'E']
# Метод split() разбивает строку на слова по пробелу.
# В результате получаем список слов в строке и заносим его в переменную address_list.
    address_list = address.split(' ')
# Обрезаем список, оставляя в нём только последний элемент,
# потенциальный подтип улицы, и заносим в переменную street_type.
    street_type = address_list[-1]
# Делаем проверку на то, что полученный подтип является географической пометкой.
# Для этого проверяем его на наличие в списке exclude_list.
    if street_type in exclude_list:
# Если переменная street_type является географической пометкой,
# переопределяем её на второй элемент с конца списка address_list.
        street_type = address_list[-2]
# Возвращаем переменную street_type, в которой хранится подтип улицы.
    return street_type

street_types = melb_df['Address'].apply(get_street_type)
street_types

0        St
1        St
2        St
3        La
4        St
         ..
13575    Cr
13576    Dr
13577    St
13578    St
13579    St
Name: Address, Length: 13580, dtype: object

In [57]:
street_types.value_counts()

St           8012
Rd           2825
Ct            612
Dr            447
Av            321
Gr            311
Pde           211
Pl            169
Cr            152
Cl            100
La             67
Bvd            53
Tce            47
Wy             40
Avenue         40
Cct            25
Hwy            24
Parade         15
Boulevard      13
Sq             11
Crescent        9
Cir             7
Strand          7
Esplanade       6
Grove           5
Gdns            4
Grn             4
Fairway         4
Mews            4
Crossway        3
Righi           3
Victoria        2
Ridge           2
Crofts          2
Esp             2
Glade           1
Gra             1
Ave             1
Woodland        1
Outlook         1
Hts             1
Highway         1
Athol           1
Summit          1
Grand           1
Res             1
Nook            1
Eyrie           1
Dell            1
East            1
Loop            1
Grange          1
Terrace         1
Cove            1
Qy              1
Corso           1
Name: Address, dtype: int64

In [58]:
street_types.nunique()

56

In [59]:
popular_stypes =street_types.value_counts().nlargest(10).index
print(popular_stypes)

Index(['St', 'Rd', 'Ct', 'Dr', 'Av', 'Gr', 'Pde', 'Pl', 'Cr', 'Cl'], dtype='object')

In [60]:
street_types = street_types.apply(lambda x: 'Av' if x == 'Avenue' else x)\
                           .apply(lambda x: 'Bvd' if x == 'Boulevard' else x)\
                           .apply(lambda x: 'Pde' if x == 'Parade' else x)

In [61]:
street_types.nunique()

53

In [62]:
melb_df['StreetType'] = street_types.apply(lambda x: x if x in popular_stypes else 'other')
melb_df['StreetType'].value_counts()

St       8012
Rd       2825
Ct        612
Dr        447
other     365
Av        361
Gr        311
Pde       226
Pl        169
Cr        152
Cl        100
Name: StreetType, dtype: int64

In [63]:
melb_df = melb_df.drop('Address', axis=1)

In [64]:
def get_weekend(weekday):
    if (weekday == 5) or (weekday == 6):
        return 1
    else:
        return 0

melb_df['Weekend'] = melb_df['WeekdaySale'].apply(get_weekend)
round(melb_df[melb_df['Weekend'] == 1]['Price'].mean(), 1)

1081198.6

In [65]:
pop_seller = melb_df['SellerG'].value_counts().nlargest(49).index
pop_seller

Index(['Nelson', 'Jellis', 'hockingstuart', 'Barry', 'Ray', 'Marshall',
       'Buxton', 'Biggin', 'Brad', 'Fletchers', 'Woodards', 'Jas', 'Greg',
       'McGrath', 'Sweeney', 'Noel', 'Miles', 'RT', 'Gary', 'Harcourts',
       'Hodges', 'YPA', 'Stockdale', 'Village', 'Kay', 'Raine', 'Williams',
       'Love', 'Douglas', 'Chisholm', 'RW', 'Rendina', 'HAR', 'O'Brien', 'C21',
       'Collins', 'Cayzer', 'Eview', 'Purplebricks', 'Philip', 'Buckingham',
       'Bells', 'Thomson', 'Nick', 'Alexkarbon', 'McDonald', 'Burnham',
       'Moonee', 'LITTLE'],
      dtype='object')

In [66]:
melb_df['SellerG'] = melb_df['SellerG'].apply(lambda x: x if x in pop_seller else 'other')
melb_df['SellerG'].nunique()

50

In [67]:
mn_Nelson = melb_df[melb_df['SellerG'] == 'Nelson']['Price'].min()
mn_oth = melb_df[melb_df['SellerG'] == 'other']['Price'].min()
round(mn_Nelson / mn_oth, 1)

1.3

In [68]:
cols_to_exclude = ['Date', 'Rooms', 'Bedroom', 'Bathroom', 'Car'] # список столбцов, которые мы не берём во внимание
max_unique_count = 150 # задаём максимальное число уникальных категорий
for col in melb_df.columns: # цикл по именам столбцов
    if melb_df[col].nunique() < max_unique_count and col not in cols_to_exclude: # проверяем условие
        melb_df[col] = melb_df[col].astype('category') # преобразуем тип столбца

In [69]:
melb_df['Regionname'].cat.categories

Index(['Eastern Metropolitan', 'Eastern Victoria', 'Northern Metropolitan',
       'Northern Victoria', 'South-Eastern Metropolitan',
       'Southern Metropolitan', 'Western Metropolitan', 'Western Victoria'],
      dtype='object')

In [70]:
melb_df['Type'] = melb_df['Type'].cat.rename_categories({
    'u': 'unit',
    't': 'townhouse',
    'h': 'house'
})
display(melb_df['Type'])

0        house
1        house
2        house
3        house
4        house
         ...
13575    house
13576    house
13577    house
13578    house
13579    house
Name: Type, Length: 13580, dtype: category
Categories (3, object): ['house', 'townhouse', 'unit']

In [71]:
pop_suburb = melb_df['Suburb'].value_counts().nlargest(119).index

In [72]:
melb_df['Suburb'] = melb_df['Suburb'].apply(lambda x: x if x in pop_suburb else 'other')
melb_df['Suburb'] = melb_df['Suburb'].astype('category')

In [73]:
melb_df.sort_values('Price').head(10)

,Suburb,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom,...,Longtitude,Regionname,Propertycount,MeanRoomsSquare,AreaRatio,MonthSale,AgeBuilding,WeekdaySale,StreetType,Weekend
2652,Footscray,1,unit,85000.0,PI,Burnham,2016-09-03,6.4,3011,1,...,144.89000,Western Metropolitan,7570,42.000000,1.000000,9,9,5,St,1
1805,other,4,house,131000.0,PI,other,2017-02-25,8.9,3162,4,...,145.02420,Southern Metropolitan,2379,17.222222,-0.525994,2,97,5,St,1
7303,Albion,1,unit,145000.0,PI,Biggin,2016-05-28,13.9,3020,2,...,144.82660,Western Metropolitan,2185,31.500000,0.555556,5,46,5,St,1
1927,Coburg,4,house,145000.0,PI,Jellis,2016-06-04,7.8,3058,3,...,144.96580,Northern Metropolitan,11204,20.500000,-0.531429,6,106,5,Rd,1
7940,Hawthorn,1,unit,160000.0,VB,HAR,2017-04-08,4.6,3122,1,...,145.03730,Southern Metropolitan,11308,42.000000,-0.437500,4,8,5,St,1
12666,Brunswick,1,unit,170000.0,VB,Nelson,2017-09-16,5.2,3056,1,...,144.95188,Northern Metropolitan,11918,42.000000,-0.816860,9,47,5,St,1
8811,Footscray,1,unit,170000.0,PI,Burnham,2017-07-01,5.1,3011,1,...,144.89587,Western Metropolitan,7570,8.666667,-0.071429,7,4,5,St,1
8504,West Footscray,1,unit,185000.0,PI,Jas,2017-04-29,8.2,3012,1,...,144.86720,Western Metropolitan,5058,42.000000,1.000000,4,47,5,St,1
7293,Albion,1,unit,185000.0,S,hockingstuart,2016-08-22,13.9,3020,1,...,144.82720,Western Metropolitan,2185,14.333333,-0.964017,8,41,0,Rd,0
7305,Albion,2,unit,190000.0,SP,Burnham,2016-07-30,13.9,3020,2,...,144.82390,Western Metropolitan,2185,25.200000,1.000000,7,46,5,St,1

In [74]:
melb_df.sort_values('AreaRatio', ascending=False, ignore_index=True).loc[::10, 'AreaRatio']

0        1.000000
10       1.000000
20       1.000000
30       1.000000
40       1.000000
           ...
13530   -0.986232
13540   -0.989284
13550   -0.993750
13560   -0.997525
13570   -1.000000
Name: AreaRatio, Length: 1358, dtype: float64

In [75]:
round(melb_df.sort_values(
    'AreaRatio', 
    ascending=False, 
    ignore_index=True
).loc[1558, 'BuildingArea'])

126

In [76]:
mask1 = melb_df['Type'] == 'townhouse'
mask2 = melb_df['Rooms'] > 2

melb_df[mask1 & mask2].sort_values(
    ['Rooms', 'MeanRoomsSquare'],
    ascending=[True, False],
    ignore_index=True
)

,Suburb,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom,...,Longtitude,Regionname,Propertycount,MeanRoomsSquare,AreaRatio,MonthSale,AgeBuilding,WeekdaySale,StreetType,Weekend
0,other,3,townhouse,1900000.0,PI,other,2017-07-08,24.8,3156,3,...,145.29371,Eastern Metropolitan,10788,62.750000,-0.576550,7,47,5,Cr,1
1,Brighton,3,townhouse,3275000.0,SP,Marshall,2017-06-24,10.5,3186,3,...,144.99233,Southern Metropolitan,10579,46.451525,0.125054,6,47,5,St,1
2,Moonee Ponds,3,townhouse,1345000.0,SP,Barry,2016-05-22,6.9,3039,3,...,144.91260,Western Metropolitan,6232,35.875000,-0.038526,5,86,6,St,1
3,Ashburton,3,townhouse,2050000.0,S,Fletchers,2016-12-03,11.0,3147,3,...,145.07140,Southern Metropolitan,3052,35.000000,0.008000,12,2,5,St,1
4,Strathmore,3,townhouse,925000.0,S,other,2017-04-08,9.7,3041,3,...,144.92280,Western Metropolitan,3284,32.555556,-0.308962,4,47,5,St,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
779,Moonee Ponds,5,townhouse,980000.0,PI,Nelson,2017-03-18,6.9,3039,5,...,144.93330,Western Metropolitan,6232,14.000000,-0.104000,3,13,5,St,1
780,Glenroy,5,townhouse,645000.0,S,Barry,2017-05-20,13.0,3046,5,...,144.94100,Northern Metropolitan,8870,13.818182,-0.197889,5,4,5,St,1
781,Chadstone,5,townhouse,1050000.0,S,Buxton,2017-07-29,11.7,3148,5,...,145.09741,Southern Metropolitan,3582,13.250000,-0.268966,7,6,5,Ct,1
782,Maribyrnong,5,townhouse,1000000.0,PI,other,2017-02-25,8.7,3032,5,...,144.89390,Western Metropolitan,4918,9.692308,0.125000,2,47,5,Dr,1
783,Doncaster East,5,townhouse,1500000.0,SP,hockingstuart,2017-06-17,14.3,3109,5,...,145.15690,Eastern Metropolitan,10999,9.692308,-0.486762,6,47,5,St,1

In [77]:
round(melb_df[mask1 & mask2].sort_values(
    ['Rooms', 'MeanRoomsSquare'],
    ascending=[True, False],
    ignore_index=True
).loc[18, 'Price'])

1300000

In [78]:
melb_df.groupby('Type', as_index = False)['Price'].mean()

        Type         Price
0      house  1.242665e+06
1  townhouse  9.337351e+05
2       unit  6.051275e+05

In [79]:
melb_df.groupby('Rooms', as_index=False)['Price'].mean().sort_values('Price', ascending=False)

   Rooms         Price
6      7  1.920700e+06
4      5  1.870260e+06
5      6  1.849366e+06
7      8  1.602750e+06
3      4  1.445282e+06
2      3  1.076081e+06
8     10  9.000000e+05
1      2  7.750812e+05
0      1  4.338245e+05

In [80]:
melb_df.groupby('Rooms')['Price'].mean().sort_values(ascending=False)

Rooms
7     1.920700e+06
5     1.870260e+06
6     1.849366e+06
8     1.602750e+06
4     1.445282e+06
3     1.076081e+06
10    9.000000e+05
2     7.750812e+05
1     4.338245e+05
Name: Price, dtype: float64

In [81]:
melb_df.groupby('Regionname')['Lattitude'].std().sort_values().head(1).index[0]

'Western Victoria'

In [88]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)
melb_df['Date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 13580 entries, 0 to 13579
Series name: Date
Non-Null Count  Dtype
--------------  -----
13580 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 106.2 KB

In [91]:
date1 = pd.to_datetime('01-05-2017', dayfirst=True)
date2 = pd.to_datetime('01-09-2017', dayfirst=True)
mask3 = melb_df['Date'] >= date1
mask4 = melb_df['Date'] <= date2
melb_df[mask3 & mask4].groupby('SellerG')['Price'].sum().sort_values()

SellerG
LITTLE             4509000.0
Burnham            5968000.0
Moonee             8045000.0
Bells             10311000.0
Thomson           10974000.0
Alexkarbon        11387000.0
Cayzer            15000000.0
Nick              16665000.0
Douglas           17586000.0
Rendina           18242276.0
Eview             19036500.0
McDonald          19727500.0
Buckingham        20597100.0
Collins           22730000.0
C21               23222500.0
Love              23357500.0
Philip            24895300.0
Williams          24996000.0
Purplebricks      26826501.0
HAR               28690000.0
Chisholm          29663250.0
RW                31751500.0
Village           32533000.0
Raine             34343700.0
O'Brien           36835508.0
Stockdale         42174800.0
Gary              46945300.0
Sweeney           47091250.0
Miles             51962000.0
YPA               59917350.0
Jas               61651100.0
Brad              63168000.0
Kay               64859500.0
Hodges            67881500.0
RT                69407000.0
Harcourts         90125750.0
Greg              91541000.0
McGrath          101451500.0
Woodards         103738250.0
Noel             105755800.0
Biggin           123899500.0
Fletchers        139453700.0
Buxton           267192000.0
Ray              306402986.0
hockingstuart    318537510.0
Marshall         331175888.0
Barry            353243850.0
other            434512632.0
Nelson           450735500.0
Jellis           535351557.0
Name: Price, dtype: float64

In [ ]:
# melb_df[melb_df[mask3] & melb_df[mask4]].groupby('SellerG')['Price'].sum().sort_values()
# melb_df[[mask3 & mask4]].groupby('SellerG')['Price'].sum().sort_values()
# melb_df[[mask3] &[mask4]].groupby('SellerG')['Price'].sum().sort_values()

In [90]:
date1 = pd.to_datetime('2017-05-01')
date2 = pd.to_datetime('2017-09-01')
mask = (date1 <= melb_df['Date']) & (melb_df['Date']<= date2)
melb_df[mask].groupby('SellerG')['Price'].sum().sort_values(ascending=True)

SellerG
LITTLE             4509000.0
Burnham            5968000.0
Moonee             8045000.0
Bells             10311000.0
Thomson           10974000.0
Alexkarbon        11387000.0
Cayzer            15000000.0
Nick              16665000.0
Douglas           17586000.0
Rendina           18242276.0
Eview             19036500.0
McDonald          19727500.0
Buckingham        20597100.0
Collins           22730000.0
C21               23222500.0
Love              23357500.0
Philip            24895300.0
Williams          24996000.0
Purplebricks      26826501.0
HAR               28690000.0
Chisholm          29663250.0
RW                31751500.0
Village           32533000.0
Raine             34343700.0
O'Brien           36835508.0
Stockdale         42174800.0
Gary              46945300.0
Sweeney           47091250.0
Miles             51962000.0
YPA               59917350.0
Jas               61651100.0
Brad              63168000.0
Kay               64859500.0
Hodges            67881500.0
RT                69407000.0
Harcourts         90125750.0
Greg              91541000.0
McGrath          101451500.0
Woodards         103738250.0
Noel             105755800.0
Biggin           123899500.0
Fletchers        139453700.0
Buxton           267192000.0
Ray              306402986.0
hockingstuart    318537510.0
Marshall         331175888.0
Barry            353243850.0
other            434512632.0
Nelson           450735500.0
Jellis           535351557.0
Name: Price, dtype: float64

In [ ]:
melb_df[mask].groupby('SellerG')['Price'].sum().sort_values(ascending=True).head(1).index[0]

'LITTLE'

In [ ]:
pivot = melb_df.pivot_table(
    values='BuildingArea',
    index='Rooms',
    columns='Type',
    aggfunc='median',
    fill_value=0
)
pivot

Type   house  townhouse   unit
Rooms
1      126.0       88.0   69.5
2      126.0      114.0  110.0
3      126.0      126.0  126.0
4      141.0      159.5  126.0
5      177.0      152.0    0.0
6      126.0        0.0  171.0
7      216.5        0.0    0.0
8      126.0        0.0  126.0
10     126.0        0.0    0.0

In [ ]:
print(pivot['house'].max(), pivot['townhouse'].max(), pivot['unit'].max(), sep='\n')

216.5
159.5
171.0

In [ ]:
pivot.sort_values('house', ascending=False).head(1)

Type   house  townhouse  unit
Rooms
7      216.5        0.0   0.0

In [ ]:
pivot = melb_df.pivot_table(
    values='Price',
    index='SellerG',
    columns='Type',
    aggfunc='median'
)
pivot

Type               house  townhouse      unit
SellerG
Alexkarbon     1036250.0   935000.0  560000.0
Barry           830000.0   727500.0  502000.0
Bells           692500.0   430500.0  457500.0
Biggin         1151750.0   675000.0  548000.0
Brad            875000.0   700000.0  465000.0
Buckingham      830000.0   820000.0  553000.0
Burnham         922500.0        NaN  305000.0
Buxton         1323750.0  1030000.0  670000.0
C21             836500.0   768750.0  625500.0
Cayzer         1505000.0  1450000.0  707500.0
Chisholm       1520000.0   950000.0  640000.0
Collins        1566500.0   930000.0  592000.0
Douglas         684000.0   500000.0  494500.0
Eview           760000.0   597500.0  602000.0
Fletchers      1390000.0  1238000.0  653000.0
Gary           1370000.0   993500.0  550000.0
Greg           1330000.0   900000.0  547500.0
HAR             695000.0        NaN  518000.0
Harcourts       740000.0   653750.0  500000.0
Hodges         1500000.0  1105000.0  605500.0
Jas             935000.0   699000.0  455000.0
Jellis         1505000.0  1052000.0  591750.0
Kay            2220000.0  1365000.0  695000.0
LITTLE          970000.0   800000.0  447000.0
Love            780000.0   846000.0  440000.0
Marshall       1975000.0  1408500.0  715000.0
McDonald       1242500.0        NaN  502500.0
McGrath        1250000.0   810000.0  542500.0
Miles          1090000.0   721500.0  555000.0
Moonee          806000.0   715000.0  622000.0
Nelson         1055000.0   730000.0  530000.0
Nick           2025000.0   780000.0  900000.0
Noel           1400500.0   990000.0  693250.0
O'Brien         737504.0   430000.0  618500.0
Philip         1035000.0   701000.0  636000.0
Purplebricks    810000.0   927500.0  582500.0
RT             1640000.0  1400000.0  630000.0
RW              870000.0   630500.0  625500.0
Raine           745000.0   608000.0  447500.0
Ray             900000.0   650000.0  497500.0
Rendina        1190000.0   750000.0  459000.0
Stockdale       715500.0   550000.0  410000.0
Sweeney         850000.0   728000.0  381000.0
Thomson        1177000.0   500000.0  495000.0
Village         973500.0   727500.0  420000.0
Williams       1161000.0   735000.0  577000.0
Woodards       1261000.0   865500.0  600000.0
YPA             596250.0   498500.0  443500.0
hockingstuart  1055000.0   935000.0  566000.0
other           901000.0   840500.0  535000.0

In [ ]:
max_unit_price = pivot['unit'].max()
print(pivot[pivot['unit'] == max_unit_price].index[0])

Nick

In [ ]:
print(pivot[pivot['unit'] == max_unit_price])

Type         house  townhouse      unit
SellerG
Nick     2025000.0   780000.0  900000.0